pinstagram-backend/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ad"], ["post_id", 1], ["user_id", 1], ["created_at", "2020-07-30 04:40:51.590489"], ["updated_at", "2020-07-30 04:40:51.590489"]]
---
    def create
        comment = Comment.new(comment_params)
        comment.save