pinstagram-backend/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
    def index
        likes = Like.all

INSERT INTO "likes" ("post_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["post_id", 1], ["created_at", "2020-07-28 17:50:39.996516"], ["updated_at", "2020-07-28 17:50:39.996516"]]
---
    def create
        like = Like.new(like_params)
        like.save