pinstagram-backend/app/controllers/posts_controller.rb

    def index
        posts = Post.all
---
SELECT "posts".* FROM "posts"

    def create
        post = Post.new(post_params)
        post.save
---
INSERT INTO "posts" ("title", "image_url", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "How do I access my tables in ActiveRecord"], ["image_url", "sdadsad"], ["content", "sdadsad"], ["created_at", "2020-07-28 19:21:05.925748"], ["updated_at", "2020-07-28 19:21:05.925748"]]